# GetMacroManagerIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroManager..::..GetMacroManagerIterator Method
MacroManager Class See Also
---
Returns a Macro manager iterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public MacroManagerIterator GetMacroManagerIterator()
```

Visual Basic
---
```text
Public Function GetMacroManagerIterator As MacroManagerIterator
```

Visual C++
---
```text
public:
MacroManagerIterator^ GetMacroManagerIterator()
```

# ### Return Value
A Macro manager iterator object that can be used to iterate through key-value pairs in the collection.
# See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace